In [4]:
# Import Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
# Import Dataset
ds = pd.read_csv("raw_messy_dataset.csv")

In [7]:
ds.head(10)

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
5,Frank,unknown,Other,user5@example.com,NaN,70000,Admin
6,Grace,unknown,Female,user6@example.com,"July 4, 2020",80000,Engineering
7,Hannah,NaN,Other,user7@example.com,2021-05-21,NaN,HR
8,Ivy,30,Female,user8@example.com,NaN,50000,Engineering
9,Jack,35,Male,user9@example.com,2020/01/01,80000,Engineering

In [4]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         72 non-null     object
 2   Gender      89 non-null     object
 3   Email       95 non-null     object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: object(7)
memory usage: 5.9+ KB

In [5]:
ds.describe()

         Name Age Gender              Email   Join_Date Salary   Department
count     105  72     89                 95          70     78           89
unique     10   5      5                 90           4      5            5
top     Alice  40   Male  user0@example.com  2021-05-21  50000  Engineering
freq       11  22     22                  2          26     22           26

In [7]:
#searching for duplicate
ds.duplicated().sum()

5

In [9]:
#Remove Duplicates
ds.drop_duplicates(inplace = True)

In [10]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         69 non-null     object
 2   Gender      86 non-null     object
 3   Email       90 non-null     object
 4   Join_Date   66 non-null     object
 5   Salary      74 non-null     object
 6   Department  84 non-null     object
dtypes: object(7)
memory usage: 6.2+ KB

In [11]:
#Columns Name
ds.columns

Index(['Name', 'Age', 'Gender', 'Email', 'Join_Date', 'Salary', 'Department'], dtype='object')

In [18]:
# Handling Age
ds["Age"] = pd.to_numeric(ds["Age"], errors='coerce')

In [27]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   66 non-null     object
 5   Salary      74 non-null     object
 6   Department  84 non-null     object
dtypes: float64(1), object(6)
memory usage: 6.2+ KB

In [30]:
x = ds["Age"].median()
x

35.0

In [31]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   66 non-null     object
 5   Salary      74 non-null     object
 6   Department  84 non-null     object
dtypes: float64(1), object(6)
memory usage: 6.2+ KB

In [8]:
ds["Gender"].unique()

array([nan, 'M', 'Male', 'Other', 'Female', 'F'], dtype=object)

In [9]:
# Standerdized Gender
ds["Gender"]=ds["Gender"].replace({"M":"male","F":"female","Nan":"None"})
ds["Gender"].fillna("Unknown",inplace = True)

C:\Users\anush\AppData\Local\Temp\ipykernel_23832\2946437418.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Gender"].fillna("Unknown",inplace = True)

In [32]:
#Hamdling Email 

ds.fillna({"Email": "Null"}, inplace=True)

In [34]:
print (ds.to_string)

<bound method DataFrame.to_string of        Name   Age  Gender              Email     Join_Date Salary   Department
0     Alice  35.0     NaN  user0@example.com    2021-05-21    NaN        Admin
1       Bob  40.0    Male  user1@example.com           NaN  50000  Engineering
2   Charlie  35.0    Male  user2@example.com    2020/01/01  50000           HR
3     David  35.0     NaN  user3@example.com    2021-05-21  70000        Admin
4       Eva  35.0   Other  user4@example.com  July 4, 2020  70000  Engineering
..      ...   ...     ...                ...           ...    ...          ...
95    Frank  35.0    Male               Null           NaN  50000          NaN
96    Grace  40.0    Male               Null           NaN  70000        Sales
97   Hannah  35.0    Male               Null    2020/01/01  60000          NaN
98      Ivy  35.0  Female               Null    2020/01/01  50000          NaN
99     Jack  35.0     NaN               Null  July 4, 2020  60000        Admin

[100 rows x 7 columns]>

In [36]:
ds.columns

Index(['Name', 'Age', 'Gender', 'Email', 'Join_Date', 'Salary', 'Department'], dtype='object')

In [39]:
# Handling Date Column
ds["Join_Date"] = pd.to_datetime(ds["Join_Date"], errors='coerce')

In [40]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      74 non-null     object
 6   Department  84 non-null     object
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 6.2+ KB

In [43]:
# Handling Salary Column

ds["Salary"] = pd.to_numeric (ds["Salary"],errors='coerce')

In [44]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      60 non-null     float64
 6   Department  84 non-null     object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 6.2+ KB

In [45]:
# Handling Department
ds["Department"].unique()

array(['Admin', 'Engineering', 'HR', 'Sales', nan, 'Marketing'],
      dtype=object)

In [46]:
y = ds ["Department"].mode()[0]
ds["Department"].fillna(y,inplace = True)

C:\Users\anush\AppData\Local\Temp\ipykernel_13456\281353045.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Department"].fillna(y,inplace = True)

In [11]:
#save data into new file
ds.to_csv("cleaned_data.csv")